In [ ]:


SELECT NOM FROM `Base_de_datos_1.ALUMNOS`
WHERE PAIS LIKE 'Portugal';

SELECT * FROM `Base_de_datos_1.MASTER`
WHERE NOM LIKE '%D%';

SELECT NOM FROM `Base_de_datos_1.ALUMNOS`
WHERE ID BETWEEN 37 AND 45;

SELECT NOM,EMAIL FROM `Base_de_datos_1.ALUMNOS`
ORDER BY NOM;

INSERT INTO `Base_de_datos_1.ALUMNOS`
(ID,NOM,COGNOM,PAIS,DIRECCION,EMAIL) 
VALUES (547,'Javier','Conejero','Espa√±a','Plaza Honduras','javicone@gmail.com');

UPDATE `Base_de_datos_1.ALUMNOS`
SET EMAIL = 'javicone47@gmail.com'
WHERE NOM = 'Javier';

UPDATE `Base_de_datos_1.ALUMNOS`
SET PAIS = 'Mexico' WHERE NOM = 'Javier';


INSERT INTO `Base_de_datos_1.ALU_MASTER`
(ID,ALU_ID,MAS_ID) 
VALUES (105,(SELECT ID FROM `Base_de_datos_1.ALUMNOS` WHERE NOM LIKE 'Illojuan'),(SELECT ID FROM `Base_de_datos_1.MASTER` WHERE NOM LIKE 'MDA2'));

SELECT *
FROM `Base_de_datos_1.ALUMNOS`, `Base_de_datos_1.ALU_MASTER`, `Base_de_datos_1.MASTER`
WHERE `Base_de_datos_1.ALUMNOS`.ID = 81
AND `Base_de_datos_1.ALUMNOS`.ID = `Base_de_datos_1.ALU_MASTER`.ALU_ID
AND `Base_de_datos_1.MASTER`.ID = `Base_de_datos_1.ALU_MASTER`.MAS_ID;

DELETE FROM `Base_de_datos_1.ALUMNOS`
WHERE NOM LIKE 'Illojuan';

DELETE  FROM`Base_de_datos_1.ALUMNOS`
WHERE ID NOT IN (SELECT ALU_ID FROM `Base_de_datos_1.ALU_MASTER`);

DELETE FROM `Base_de_datos_1.MASTER`
WHERE id NOT IN (SELECT MAS_ID FROM `Base_de_datos_1.ALU_MASTER` );


UPDATE `Base_de_datos_1.ALUMNOS` SET EMAIL = NULL 
WHERE ID IN (SELECT ALU_ID FROM `Base_de_datos_1.ALU_MASTER` WHERE MAS_ID IN
(SELECT ID FROM `Base_de_datos_1.MASTER` WHERE NOM = 'MDA'));


#Creacion de la tabla
CREATE TABLE Base_de_datos_1.GASTOS(
  Id INT NOT NULL,
  Mes STRING(15) NOT NULL,
  Cantidad DECIMAL NOT NULL,
  Descripcion STRING(250)
);

#Borrar tabla

DROP TABLE Base_de_datos_1.GASTOS;

#Unir 3 tablas
SELECT A.NOM,A.COGNOM,M.Nom
FROM `Base_de_datos_1.ALUMNOS` A
JOIN `Base_de_datos_1.ALU_MASTER` AL
ON A.ID= AL.ALU_ID
JOIN `Base_de_datos_1.MASTER` M
ON AL.MAS_ID=M.id;


#Comandos
#SELECT COUNT(*)
 #      SUM(Columna que queremos sumar)
  #     AVG(Sueldo)
   #    MIN(Sueldo)
    #   MAX(Sueldo)

#esri.es Datos que podemos utilizar 

#Entregable


SELECT COUNT(*) FROM(
SELECT first_name, last_name
FROM actor) AS Ej1

SELECT COUNT(*) FROM(
SELECT A.first_name,A.last_name, F.title
FROM actor A, film_actor FA, film F
WHERE A.actor_id = FA.actor_id AND FA.film_id = F.film_id) AS Ej2

SELECT COUNT(*) FROM(
SELECT A.first_name,A.last_name, COUNT(F.title)
FROM actor A, film_actor FA, film F
WHERE A.actor_id = FA.actor_id AND FA.film_id = F.film_id
GROUP BY A.first_name,A.last_name
ORDER BY COUNT(F.title) DESC) AS Ej3

SELECT COUNT(*) FROM(
SELECT F.title, COUNT(R.rental_id)
FROM film F, inventory I, rental R
WHERE F.film_id = I.film_id AND I.inventory_id = R.inventory_id
GROUP BY F.title
ORDER BY COUNT(R.rental_id) DESC) AS Ej4

SELECT COUNT(*) FROM(
SELECT F.title, SUM(P.amount)
FROM film F, inventory I, rental R, payment P
WHERE F.film_id = I.film_id AND I.inventory_id = R.inventory_id 
AND R.customer_id = P.customer_id
GROUP BY F.title
ORDER BY SUM(P.amount) DESC) AS Ej5


SELECT C.first_name, C.last_name, SUM(P.amount)
FROM customer C, rental R, payment P
WHERE C.customer_id= R.customer_id AND R.rental_id=P.rental_id
GROUP BY C.first_name, C.last_name
ORDER BY SUM(P.amount) DESC
LIMIT 1;


SELECT C.first_name, C.last_name, COUNT(R.rental_id)
FROM customer C, rental R
WHERE C.customer_id= R.customer_id 
GROUP BY C.first_name, C.last_name
ORDER BY COUNT(R.rental_id) DESC
LIMIT 1